Revit 2027 API
StructuralSectionRound.CentroidHorizontal Property
 Distance from centroid to the left extremites along horizontal axis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CentroidHorizontal { get; set; }
Public Property CentroidHorizontal As Double
	Get
	Set
public:
property double CentroidHorizontal {
	double get ();
	void set (double value);
}
member CentroidHorizontal : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace